---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovedFromDocumentEventArgs
source: html/779cbe14-c0fc-ff4a-3de9-3d17adb34322.htm
---
# ExternalDataInstanceRemovedFromDocumentEventArgs Methods

Indicates whether the event is being cancelled.